Repository: btsolidcodes/rbr-scraper-api
Catalog: rBR.Scraper/rBR.BaseLibraries/Properties/BaseValidationErrorMessages.*.resx
Languages: pt_br

# AtLeastOneField
source: At least one of the following fields must have a value: {0}.
pt_br: Ao menos um dos seguintes campos deve ter um valor: {0}.

# EmptyGuid
source: The field [{PropertyName}] can't be an empty GUID.
pt_br: O campo [{PropertyName}] não pode ser um GUID vazio.

# ExactLength
source: The [{PropertyName}] field must have an exact length of [{MaxLength}] characters.
pt_br: O campo [{PropertyName}] deve ter um comprimento exato de [{MaxLength}] caracteres.

# InclusiveBetween
source: The field [{PropertyName}] must be inclusive between [{From}] and [{To}].
pt_br: O campo [{PropertyName}] deve estar incluso entre [{From}] e [{To}].

# InvalidCNPJ
source: The [{PropertyName}] field must be a valid CNPJ.
pt_br: O campo [{PropertyName}] deve ser um CNPJ válido.

# InvalidCNPJDescribed
source: The [CNPJ] field must be a valid CNPJ.
pt_br: O campo [CNPJ] deve ser um CNPJ válido.

# InvalidEmail
source: The [{PropertyName}] field must be a valid email.
pt_br: O campo [{PropertyName}] deve ser um e-mail válido.

# InvalidEmptyField
source: The field [{0}] is required and can't be empty.
pt_br: Ocampo [{0}] é obrigatório e não pode ser vazio.

# InvalidEmptyGuid
source: The field [{0}] can't be an empty GUID.
pt_br: O campo [{0}] não pode ser um GUID vazio.

# InvalidFutureDate
source: The field [{0}] can't be a future date.
pt_br: O campo [{0}] não pode ser uma data futura.

# InvalidFutureDatePropertyName
source: The field [{PropertyName}] can't be a future date.
pt_br: O campo [{PropertyName}] não pode ser uma data futura.

# InvalidMaximumAge
source: The user must be, at most, 100 years old.
pt_br: O usuário deve ter, no máximo, 100 anos de idade.

# InvalidMaximumPageSize
source: The maximum allowed page size is [{0}].
pt_br: O valor máximo permitido para o tamanho da página é de [{0}].

# InvalidMinimumAge
source: The user must be, at least, 18 years old.
pt_br: O usuário deve ter, ao menos, 18 anos de idade.

# InvalidMinimumPage
source: The minimum allowed page is [{0}].
pt_br: O valor mínimo para a página é [{0}].

# InvalidMinimumPageSize
source: The minimum allowed page size is [{0}].
pt_br: O valor mínimo para o tamanho da págine é de [{0}].

# InvalidPhoneNumber
source: The [{PropertyName}] field must be a valid phone number.
pt_br: O campo [{PropertyName}] deve ser um número de telefone válido.

# InvalidStatus
source: The field [{0}] must be a value between [{1}] and [{2}].
pt_br: O campo [{0}] deve ser um valor entre [{1}] e [{2}].

# InvalidZipCode
source: The [{PropertyName}] field must be a valid zip code.
pt_br: O campo [{PropertyName}] deve ser um CEP válido.

# MaximumLength
source: The [{PropertyName}] field must have a maximum length of [{MaxLength}] characters.
pt_br: O campo [{PropertyName}] deve ter um comprimento máximo de [{MaxLength}] caracteres.

# MinimumLength
source: The [{PropertyName}] field must have a minimum length of [{MinLength}] characters.
pt_br: O campo [{PropertyName}] deve ter um comprimento mínimo de [{MinLength}] caracteres.

# NotEmpty
source: The field [{PropertyName}] can't be null or empty.
pt_br: O campo [{PropertyName}] não pode ser nulo ou vazio.

# NotNull
source: The field [{PropertyName}] can't be null.
pt_br: O campo [{PropertyName}] não pode ser nulo.

# StartDateGreaterThanFinishDate
source: The field [{PropertyName}] can't be greater than the [{ComparisonValue}].
pt_br: O campo [{PropertyName}] não pode ser maior que [{ComparisonValue}].
